# GetAdjacentAnalyticalSpace Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSurface..::..GetAdjacentAnalyticalSpace Method
EnergyAnalysisSurface Class See Also
---
Gets the secondary adjacent analytical space this surface is associated with.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public EnergyAnalysisSpace GetAdjacentAnalyticalSpace()
```

Visual Basic
---
```text
Public Function GetAdjacentAnalyticalSpace As EnergyAnalysisSpace
```

Visual C++
---
```text
public:
EnergyAnalysisSpace^ GetAdjacentAnalyticalSpace()
```

# ### Return Value
The secondary analytical space.
# Remarks
An exterior surface will only have one space adjacency.
# See Also
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace